Revit 2027 API
BuiltInFailures.MEPCalculationFailures.SeparationWithOddJunction Property
 Hydraulic separation requires an even number of junctions on the header pipe for accurate calculations. Add or remove junctions to complete the separation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SeparationWithOddJunction { get; }
Public Shared ReadOnly Property SeparationWithOddJunction As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SeparationWithOddJunction {
	FailureDefinitionId^ get ();
}
static member SeparationWithOddJunction : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace